//////////////////////////挺重要的////////////////////////////////////////////////////////////////////////////////////////
// ///////////////////////写一个函数求a的二进制（补码）中有几个1//////////////////////////////////////////////////////////
////////////////////////////////////////////三种方法//////////////////////////////////////////////////////////////////////
#include<stdio.h>
//
////方法一 
////n=-1,把-1的符号位转为无符号位，unsigned
//int count_bit_one(unsigned int n)
//{
//	int count = 0;
//	while (n)
//	{
//		if (n % 2 == 1)
//		{
//			count++;
//		}
//		
//		
//		n = n / 2;
//		
//	}
//	return count;
//}
////方法二  
////n=13    00000000000000000000000000001101
////        00000000000000000000000000000001
//int count_bit_one( int n)
//{
//	int count = 0;
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (((n >> i) & 1) == 1)
//		{
//			count++;
//
//		}
//			
//	}
//	return count;
//}
//
////方法三  比较高效
////n=13 1101
////n-1  1100  n&(n-1)  1100 赋给n  少了一个1
////此时n 1100
////n-1   1011  n&(n-1) 1000 赋给n  又少了一个1
////此时n 1000
////n-1   0111  n&(n-1) 0000        又少了一个1
//int count_bit_one(int n)
//{
//	int count = 0;
//	while (n)
//	{
//		n = n&(n - 1);
//		count++;
//	}
//	return count;
//}
//int main()
//{
//	int a = 0;
//	
//	scanf_s("%d", &a);
//	//写一个函数求a的二进制（补码）中有几个1
//	int count = count_bit_one(a);
//	printf("count=:%d\n", count);
//	return 0;
//}
//int get_diff_bit(m, n)
//{
//	int tmp = m^n;//相同为0相异为1，变为二进制有几个1
//	int count = 0;
//	while (tmp)
//	{
//		//二进制有几个1
//		tmp = tmp&(tmp - 1);
//		count++;
//	}
//	return count;
//}
//int main()
//{
//	int m = 0;
//	int n = 0;
//	scanf_s("%d%d", &m, &n);
//	int count = get_diff_bit(m,n);
//	printf("count=:%d\n", count);
//	return 0;
//}

///////打印一个数的二进制的奇数位和偶数位/////////////////////////
///////
//void print(int n)
//{
//	printf("奇数位:\n");
//	int i = 0;
//	for (i = 30; i >= 0; i -= 2)
//	{
//		printf("%d ",(n >> i) & 1);
//	}
//	printf("\n");
//	printf("偶数位:\n");
//	int j = 0;
//	for (j = 31; j >= 1; j -= 2)
//	{
//		printf("%d ", (n >> j) & 1);
//	}
//	printf("\n");
//
//}
//
//int main()
//{
//	int m = 0;
//	scanf_s("%d", &m);
//	print(m);
//	return 0;
//}



///////////////////////////////////////////交换两个变量  不创建临时变量////////////////////////////////////////////
int main()
{
	int a = 10;
	int b = 20;
	printf("交换前：a=%d b=%d\n", a, b);
	a = a^b;
	b = a^b;
	a = a^b;
	printf("交换后：a=%d b=%d\n", a, b);
	return 0;
}